flow_around_cylinder_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       391020;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       391220;
    }
    wall
    {
        type            symmetry;
        inGroups        1(wall);
        nFaces          760;
        startFace       391420;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       392180;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          392000;
        startFace       392980;
    }
)

// ************************************************************************* //
